[
  {
    "url": "https://shopallpremium.com/product/onlyfans-accounts/",
    "scraped_at": "2025-07-17T19:33:24.053664",
    "name": "OnlyFans Accounts",
    "prices": [
      23,
      50,
      23,
      50,
      22,
      8,
      11,
      8,
      12,
      107,
      3,
      23,
      23,
      22,
      11,
      12,
      3,
      0,
      0,
      4,
      2,
      7,
      5,
      23,
      50,
      23,
      50,
      22,
      8,
      11,
      8,
      12,
      107,
      3
    ],
    "original_price": 107,
    "discounted_price": 0,
    "description": "OnlyFans AccountsOf course! Here’s a description for your OnlyFans account in points with emojis:🌟 Exclusive Content: Gain access to premium, exclusive content you won’t find anywhere else! 💫📸 High-Quality Media: Enjoy professionally shot photos and videos for an unparalleled viewing experience! 📹📸🎁 Special Offers: Receive exclusive deals, discounts, and bonuses for being a valued subscriber! 🎉🔞 Adult Content: Explore your wildest fantasies in a safe and respectful environment! 🔥😈💌 Direct Messaging: Chat with me anyone and get to know each other better! 💬💞💰 Discreet Billing: Your privacy is our priority. All transactions are confidential and discreet! 🤐💳",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "$100",
      "$200",
      "premium",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "Get Onlyfans Accounts with Loaded BalanceUse your Balance –Subscribe to models and see full VideosUnlock chats and Video calls with themTip models for Exclusive content for youTransfer Funds for Personalized Requests*Important Terms*Warranty: 6 – 8 hours OnlyAll Device SupportedTYPE:Account ( Email & Password)Please Read the Above Details Before purchasing."
  },
  {
    "url": "https://shopallpremium.com/product/brazzers-premium/",
    "scraped_at": "2025-07-17T19:33:27.277119",
    "name": "Brazzers Premium",
    "prices": [
      8,
      8,
      14,
      7,
      1,
      10,
      5,
      19,
      37,
      8,
      8,
      8,
      14,
      1,
      5,
      37,
      0,
      0,
      22,
      8,
      22,
      8,
      8,
      8,
      14,
      7,
      1,
      10,
      5,
      19,
      37,
      8
    ],
    "original_price": 37,
    "discounted_price": 0,
    "description": "BRAZZERS# Porn SiteOUR MISSIONThis site contains more than 10039+ videos having large number of categories. It’s world’s leading adult site having more than 4k videos.Engaging a worldwide crowd by offering a different dream insight.We offer our fans an immense universe of content – an extensive assortment of scenes set apart by unmatched quality. Unmistakable in its plenitude, the Brazzers library is an enormous organization wealthy in raised substance, from humor to high workmanship, from decadent arousing quality to in-your-face thrills.Beginning around 2004, Brazzers has been the main name in unique grown-up diversion, period. Perceived around the world, our image and its famous twofold Zs are inseparable from quality and delight. No one shows improvement over Brazzers.Brazzers Premium World’s Best HD Porn Site!We are pleased to offer our ability a remarkably shared encounter. We furnish the business’ top pornstars with an agreeable and fulfilling on-set experience that allows the world’s top entertainers to do what they excel at. This comprehensive methodology permits us to deliver extraordinary grown-up content a seemingly endless amount of many years and is the reason you can track down every one of the greatest names in the grown-up media outlet on Brazzers.comYou can buy brazzer premium using above link and you can also check these other subscriptionsMoreover you can also checkPornHub&RealityKingOn Other Hand , It contains more than 2000+ PornStars from world-wide across the globe.Nothing More to Explain It",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "pro",
      "Premium",
      "premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "*Important Terms*Do Not try to change the E-Mail or PasswordContent Download is not allowed.TYPE:Account ( Email & Password)VALIDITY:1 Month | 6 Months"
  },
  {
    "url": "https://shopallpremium.com/product/xvideos-red/",
    "scraped_at": "2025-07-17T19:33:30.254818",
    "name": "XVideos.RED",
    "prices": [
      22,
      8,
      22,
      8,
      22,
      53,
      8,
      12,
      107,
      22,
      10,
      22,
      22,
      22,
      53,
      12,
      22,
      0,
      0,
      7,
      20,
      10,
      19,
      22,
      8,
      22,
      8,
      22,
      53,
      8,
      12,
      107,
      22,
      10
    ],
    "original_price": 107,
    "discounted_price": 0,
    "description": "# XVideos.RED Premium",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinPORNFeaturesXVideos.RED PremiumWorks on All DevicesUSA IP {VPN} Should be Connected.Personal Account*Important Terms*TYPE:Our Email PasswordVALIDITY:1 MonthPersonal AccountPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/amazon-prime-video/",
    "scraped_at": "2025-07-17T19:33:33.181866",
    "name": "Amazon Prime Video",
    "prices": [
      1,
      8,
      1,
      8,
      8,
      16,
      3,
      30,
      22,
      8,
      3,
      1,
      1,
      8,
      3,
      22,
      3,
      0,
      0,
      11,
      8,
      0,
      11,
      1,
      8,
      1,
      8,
      8,
      16,
      3,
      30,
      22,
      8,
      3
    ],
    "original_price": 30,
    "discounted_price": 0,
    "description": "Amazon Prime VideoAmazon Prime Video is one of the world’s leading platforms to stream TV shows and movies. Install the app and be instantly transported to a world filled with thrills, drama, action, and romance. Watch Amazon Originals like The Family Man, Mirzapur, Made in Heaven, Inside Edge, and more. It’s not just Bollywood — sit back and enjoy a great selection of regional content too.Popular Video CategoriesAmazon Prime Video offers edge-of-the-seat entertainment with TV shows, movies, and Amazon Prime Originals.• In the mood for some edge-of-the-seat drama? We have movies full of drama, such as 2.0, Bharat, Arjun Reddy, Tumbbad, Photograph, and more. Watch all these movies from Bollywood to beyond.• Want a laugh riot? Look no further than Mr Bean: The Animated Series, Chacha Vidhayak Hain Humare, Mind the Malhotras, Young Sheldon, and COMICSTAAN which are always a hit.• Feeling patriotic? Movies like Kesari, Manikarnika: The Queen of Jhansi, Raazi will get you in the spirit on Amazon Prime Video.App Features• Amazon Prime Video makes your daily commute more fun with the option to watch movies online or download them to watch on the go, anytime, anywhere.• We’re no longer just in Hindi and English. Browse a wide catalog of shows and movies in Tamil, Telugu, Kannada, Malayalam, and Bengali.• Get recommended shows based on what you watch. Instantly add suggested titles to Your Watchlist to watch later.• All this and more at a very affordable price. Get an Amazon Prime membership and all Prime benefits on a monthly or yearly basis for ₹129/month or ₹999/year.Start Streaming in 2 Steps1. Download the Amazon Prime Video app by clicking Install. Sign in with the same Google account that you use for your Android device. You can also go to the Play Store on your mobile device and install the app directly.2. When the app is installed, sign in with your Amazon account, or create an account to watch videos online or offline.As a Prime member, watch your favourite TV shows, movies, and popular web series. Download your Amazon Prime Video app today.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "1 Month",
      "6 Months",
      "1 Year",
      "Family"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinSTREAMINGAmazon Prime Video offersa growing library of quality, original content, and a decent collection of movies and TV shows to stream. Subscribers also have the option to download content for offline viewing and watch 4K titles.Features3 SCREENPersonal AccountPassword ChangeableAll Device Supported[Smart Phone, Tablet iOS, Mac, Windows, TV, PlayStation, FireStick, etc.]*Important Terms*TYPE:Account ( Email & Password)VALIDITY:1 Month | 6 Months | 1 YearPlease don’t make any purchases after login; otherwise, the account will get locked.Use this only for Amazon Prime Video."
  },
  {
    "url": "https://shopallpremium.com/product/spotify-premium/",
    "scraped_at": "2025-07-17T19:33:36.118526",
    "name": "Spotify Premium – Individual",
    "prices": [
      0,
      11,
      0,
      11,
      5,
      19,
      119,
      16,
      11,
      8,
      8,
      52,
      0,
      0,
      5,
      119,
      11,
      8,
      0,
      0,
      1,
      8,
      8,
      16,
      0,
      11,
      0,
      11,
      5,
      19,
      119,
      16,
      11,
      8,
      8,
      52
    ],
    "original_price": 119,
    "discounted_price": 0,
    "description": "Spotify Premium MusicSpotify : Music & EntertainmentWith Spotify, you can listen to millions of songs and podcasts for free! Listen to artists you love and enjoy music in Hindi, English, Tamil, Telugu, and many more languages.Popular Categories– Listen to your favorite song, artist, or album– Discover and listen to your favorite podcasts across Music, Educational, Games, Lifestyle & Health, and more– Make and share your own playlists– Choose your preferred languages for music– Find music for any mood, genre, or activity– Listen to your favorite songs on mobile, tablet, desktop, PlayStation, Chromecast, TV, and SpeakersApp Features• Stream new music directly for free – search for the artists you love and listen instantly on your device• Trending music at your fingertips – discover one of our countless pop, Bollywood, or Hindi music playlists, or simply search your favorite artist directly• Stream songs from any genre – from pop to Hindi music, let Spotify help you discover new music you’ll love• Music streaming wherever you are – stream songs, artists or Hindi music you love. Plus, you can even listen to music even when you’re offline• Find music fast – listen to Bollywood songs, the latest artists or stream musicStart StreamingDownload music on Spotify to start building your biggest, best ever music collection.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "1 Month",
      "3 Months",
      "6 Months",
      "1 Year",
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "Spotify Premium isa digital music, podcast, and video service that gives you access to millions of songs and other content from creators all over the worldPassword ChangeablePersonal AccountFeaturesWhat’s the difference between Spotify Premium and free?Spotify Free lets you listen to music at normal (96 kilobits per second) or high quality (160 Kbps), and you can’t adjust the bitrate beyond that. Spotify Premium adds Very High-quality streaming at 320 Kbps, which can make for better, more detailed audio output if you use high-end headphones or speakers.Key FeaturesAd-free music listening.Works in all countriesEnjoy uninterrupted music.Offline playback.Save your data by listening offline.Play everywhere.Listen to your speakers, TV, and other favorite devices.Password ChangeablePersonal AccountAll Device Supported[Smart Phone, Tablet iOS, Mac, Windows, TV, PlayStation, FireStick, etc.]ACTIVATION PROCESSSpotify IndividualWe will be sent you our login credentials(Email-Password)to your email.You can check these plans officially on the spotify.com website.If still, you are not able to sort out this problem, justContact Our WhatsApp Team.UsageJust log in and use the Spotify App / Web Browser.Indian UsersVPN= Not RequiredJust follow the above instructions.International User (Outside India)Just follow the above instructions.VPN= Not RequiredFAQ (Frequently Asked Queries)Q. I am Getting an Invalid Email / Password. Reset Spotify Password EasilyJust Reset your Spotify PasswordGo tospotify.com, choose reset password to enter your emailNow go toyopmail.com. Paste the email into Empty Box.Open Mail > Reset Link, Done!Q. I have a playlist in my old Spotify Account; how can I transfer them to my new account?How to Back Up a Spotify PlaylistOpen your browser and navigate to spotmybackup.com.Click login with Spotify.Select Okay to grant SpotMyBackup access to your Spotify account.Wait while SpotMyBackup scans your account.Click on Export.Download the JSON file onto your machine.Q. How many devices can I use this Spotify  Premium?I would say unlimited; I mean as much as you can log in to multiple devices like PC, SmartPhone, TV, iOs, etc. But you can stream only one device at a time.Q. I am from London, UK. Will it work?Yes, It will work. Just Purchase Spotify Individual Plan.Q. Can I get this subscription in my existing account?Only if you purchaseSpotify Upgrade Plan,then can we activate your existing account. We just require yourSpotify ID.Don’t forget to share your Spotify ID Password.Please add it in Customer Notes on the Checkout PageQ. Can I renew my account after its expiry?Only purchasingSpotify Upgrade Plan,then it is possible to upgrade.Q. Can I change my password and email?If we are providing you with Credentials, you can change your password. Also, we recommend you change the password only.Replacement & WarrantyYou can claim your warranty if your account is not working within the warranty period.Contact WhatsApp Team to claim your replacement warrantyVALIDITY:1 Month | 3 Months | 4 Months | 6 Months | 1 YearPersonal AccountPlease Read the Above Details Before Purchasing."
  },
  {
    "url": "https://shopallpremium.com/product/youtube-premium-worldwide/",
    "scraped_at": "2025-07-17T19:33:39.101389",
    "name": "YouTube Premium (WorldWide)",
    "prices": [
      12,
      23,
      12,
      23,
      56,
      101,
      17,
      4,
      41,
      74,
      2,
      10,
      12,
      12,
      56,
      17,
      41,
      2,
      0,
      0,
      7,
      5,
      104,
      29,
      12,
      23,
      12,
      23,
      56,
      101,
      17,
      4,
      41,
      74,
      2,
      10
    ],
    "original_price": 104,
    "discounted_price": 0,
    "description": "YouTube Premium (WorldWide)YouTube – PREMIUM -No AdsGet the official YouTube app for Android phones and tablets. See what the world is watching — from the hottest music videos to what’s trending in gaming, entertainment, news, and more. Subscribe to channels you love, share with friends, and watch on any device.With a new design, you can have fun exploring videos you love more easily and quickly than before. Just tap an icon or swipe to switch between recommended videos, your subscriptions, or your account. You can also subscribe to your favorite channels, create playlists, edit and upload videos, express yourself with comments or shares, cast a video to your TV, and more – all from inside the app.Ad-free & background playEnjoy watching YouTube uninterrupted by ads whenever you sign in – on your mobile device, desktop or enabled TV. Watch videos uninterrupted by ads, while using other apps or when the screen is locked. Background playWith YouTube Premium, your video plays uninterrupted in the background, even when you open another app.DownloadsSave videos for when you really need them – like when you’re on a plane or commuting. Now, choose from more of your favourite videos to download and watch offline.YouTube Music PremiumYouTube Music PremiumDownload our new music app and listen without interruptions.FAQsWhat is included with YouTube Premium?YouTube• Ad-free videos: Watch millions of videos uninterrupted by ads.• Download videos to watch offline: Save videos and playlists on mobile devices and play them offline• Play in the background: Keep videos playing when using other apps or when your screen is off• Easily explore the world of music with the new and improved YouTube Music app• Ad-free music: Listen to millions of songs uninterrupted by ads• Download music to listen offline: Save music and playlists in the YouTube Music app and listen offline• Play in the background: Keep music playing when using other apps or when your screen is off • Ad-free and offline play in the YouTube Kids app • Included at no additional cost for selected countries.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "1 Year",
      "6 Months",
      "e or commuting. Now",
      "Premium",
      "PREMIUM",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "Works Worldwide.This Youtube Premium will work in Every Country.We will send you login credentials in your email.With YouTube Premium, you can watch millions of videos without interruptions by ads before and during a video, including video overlay ads. You will also not see third-party banner ads and search ads.FeaturesYouTube PremiumWatch videos without adsDownload videos to watch offlinePersonal AccountBackground play and Picture-in-pictureAccess to YouTube Music PremiumYouTube OriginalsAll Device Supported[Smart Phone, Tablet iOS, Mac, Windows, TV, PlayStation, FireStick, etc.]UsageJust log in and use the YouTube & YouTube Music App.Indian UsersGo to this link for purchase:Click HereInternational User (Outside India)Just Login the credentials in the Youtube App / Website.Please change the password and add a recovery email in Google Account Settings.FAQ (Frequently Asked Queries)Q. How many devices can I use for this YouTube Premium?I would say unlimited. I mean as much as you can log in to your Gmail account on multiple devices like PC, SmartPhone, TV, iOs, etc.Q. Can I get this Subscription in my existing account (Gmail)?Yes, you can activate these 6 Months and 1 Year to your existing account. First, contact ourWhatsApp Support Team.Our WhatsApp Team will guide you for activation.Q. Can I renew my 6 Months and 1 Year after expiry?Yes, of course, we can renew your plan after your plan expiry. Just place an order and contact ourWhatsApp Team.Q. Can I change my password and email?If we are providing you with Gmail Credentials, you can change your password. Also, we recommend you change the password only.Replacement & WarrantyYou can claim your warranty if your account is not working within the warranty period.Contact WhatsApp Team to claim your replacement warrantyPlease Read the Above Details Before Purchasing.TYPE:Our Email PasswordVALIDITY:1 Year | 6 Months"
  },
  {
    "url": "https://shopallpremium.com/product/naughty-america-premium/",
    "scraped_at": "2025-07-17T19:33:42.095575",
    "name": "Naughty America Premium",
    "prices": [
      7,
      20,
      2,
      10,
      119,
      16,
      22,
      8,
      4,
      7,
      2,
      119,
      22,
      4,
      0,
      0,
      149,
      35,
      494,
      49,
      7,
      20,
      2,
      10,
      119,
      16,
      22,
      8,
      4
    ],
    "original_price": 494,
    "discounted_price": 0,
    "description": "# Naughty America Premium",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "1 Month",
      "1 Year",
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinPORNFeaturesNaughty America PremiumWorks on All DevicesUSA IP {VPN} Should be Connected.Personal Account*Important Terms*TYPE:Our Email PasswordVALIDITY:1 Month | 1 YearPersonal AccountPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/spotify/",
    "scraped_at": "2025-07-17T19:33:45.037111",
    "name": "Spotify Premium – UPGRADE",
    "prices": [
      7,
      12,
      7,
      12,
      3,
      22,
      8,
      22,
      8,
      134,
      29,
      7,
      7,
      3,
      22,
      22,
      134,
      0,
      0,
      17,
      4,
      4,
      2,
      7,
      12,
      7,
      12,
      3,
      22,
      8,
      22,
      8,
      134,
      29
    ],
    "original_price": 134,
    "discounted_price": 0,
    "description": "Spotify Premium – UPGRADEWith Spotify, you can listen to millions of songs and podcasts for free! Listen to artists you love and enjoy music in Hindi, English, Tamil, Telugu, and many more languages.Popular Categories– Listen to your favorite song, artist, or album– Discover and listen to your favorite podcasts across Music, Educational, Games, Lifestyle & Health, and more– Make and share your own playlists– Choose your preferred languages for music– Find music for any mood, genre, or activity– Listen to your favorite songs on mobile, tablet, desktop, PlayStation, Chromecast, TV, and SpeakersApp FeaturesYou can also enjoy ad-free trending music and download songs with a Premium subscription.Play new music, podcasts and listen to your favorite artists with Spotify. You can even stream free music and create your own personalized playlist.Stream music and songs from the hottest artists that you love. From pop to Bollywood, there’s a playlist for everyone. Music streaming couldn’t be easier with Spotify.Music streaming made easy – 5 reasons you’ll love to stream music, Bollywood songs, and more with Spotify:• Stream new music directly for free – search for the artists you love and listen instantly on your device• Trending music at your fingertips – discover one of our countless pop, Bollywood, or Hindi music playlists, or simply search your favorite artist directly• Stream songs from any genre – from pop to Hindi music, let Spotify help you discover new music you’ll love• Music streaming wherever you are – stream songs, artists or Hindi music you love. Plus, you can even listen to music even when you’re offline• Find music fast – listen to Bollywood songs, the latest artists or stream musicMusic streaming is simple. Search for your favorite artist, Hindi music track, or trending music, then press play. Whether you want to listen to the latest pop artist or a fun playlist, there’s no limit to what you’ll find on Spotify.Start StreamingDownload music on Spotify to start building your biggest, best ever music collection.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "6 Months",
      "1 Year",
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "Spotify Premium isa digital music, podcast, and video service that gives you access to millions of songs and other content from creators all over the worldPassword ChangeablePersonal AccountFeaturesWhat’s the difference between Spotify Premium and Free?Answer:https://support.spotify.com/in-en/article/premium-plans/Spotify Free lets you listen to music at normal (96 kilobits per second) or high quality (160 Kbps), and you can’t adjust the bitrate beyond that. Spotify Premium adds Very High-quality streaming at 320 Kbps, which can make for better, more detailed audio output if you use high-end headphones or speakers.Key FeaturesAd-free music listening.Works in all countriesEnjoy uninterrupted music.Offline playback.Save your data by listening offline.Play everywhere.Listen to your speakers, TV, and other favorite devices.Password ChangeablePersonal AccountACTIVATION PROCESSSpotify UpgradeWe will upgrade your existing account to premium. Just Place an Order forSpotify Upgrade.After Placing an Order, ContactWhatsApp Team.You can check these plans officially on the spotify.com website.If still, you are not able to sort out this problem, justContact Our WhatsApp Team.UsageJust log in and use the Spotify App / Web Browser.Indian UsersVPN= Not RequiredJust follow the above instructions.International User (Outside India)Just follow the above instructions.VPN= Not RequiredFAQ (Frequently Asked Queries)Q. I have a playlist in my old Spotify Account; how can I transfer them to my new account?How to Back Up a Spotify PlaylistOpen your browser and navigate to spotmybackup.com.Click login with Spotify.Select Okay to grant SpotMyBackup access to your Spotify account.Wait while SpotMyBackup scans your account.Click on Export.Download the JSON file onto your machine.Q. How many devices can I use this Spotify  Premium?I would say unlimited, as much as you can log in to multiple devices like PC, SmartPhone, TV, iOs, etc. But you can stream only one device at a time.Q. I am from London, UK. Will it work?Yes, It will work, Just Purchase Spotify Individual Plan.Q. Can I get this subscription in my existing account?Only if you purchaseSpotify Upgrade Plan.We will activate your existing account. We just require yourSpotify ID & Password.Don’t forget to share your Spotify ID Password.Please add it in Customer Notes on the Checkout PageQ. Can I renew my account after its expiry?Only purchasingSpotify Upgrade Plan,then it is possible to upgrade.Q. Can I change my password and email?If we are providing you with Credentials, you can change your password. Also, we recommend you change the password only.Replacement & WarrantyYou can claim your warranty if your account is not working within the warranty period.Contact WhatsApp Team to claim your replacement warrantyVALIDITY:6 Months | 1 YearPersonal AccountPlease Read the Above Details Before purchasing."
  },
  {
    "url": "https://shopallpremium.com/product/pornhub-premium/",
    "scraped_at": "2025-07-17T19:33:47.887461",
    "name": "Pornhub Premium",
    "prices": [
      22,
      8,
      22,
      8,
      134,
      29,
      22,
      10,
      12,
      119,
      16,
      22,
      22,
      134,
      22,
      12,
      119,
      0,
      0,
      12,
      8,
      22,
      8,
      22,
      8,
      134,
      29,
      22,
      10,
      12,
      119,
      16
    ],
    "original_price": 134,
    "discounted_price": 0,
    "description": "PornHUB#1 Porn SitePornHubPornhub, the leading online adult entertainment platform, turned 10 years old Thursday. To celebrate this achievement, the company is launching a social media contest, offering fans a chance to win one of 100, 10-year memberships to its Pornhub Premium service.Nothing More to Explain !",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "10 years",
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "The world’s most popular adult porn site. PornHub Premium is one of several pornographic video-streaming websites. It is the 10th most trafficked website in the world.FeaturesRegion = All Over WorldLogin in 1 Device OnlyContent Download is not allowed.Shared AccountA shared account means you cannot change any account info like password, other profile, etc.All Device Supported[Smart Phone, Tablet iOS, Mac, Windows, TV, PlayStation, FireStick, etc.]Usagebr />VPN is required to use this PornHub Premium Subscription.Connect toUSARegion.We recommend you to usePremium VPNservice. You can purchase from our website.Click HereThe subscription will not verify the email, and content download is prohibited.You can stream only.Indian UsersVPN=RequiredJust follow the above instructions.International User (Outside India)VPN=Required*Important Terms*Do Not try to change the E-Mail or PasswordTYPE:Account ( Email & Password)VALIDITY:1 MonthPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/reseller-vip-membership/",
    "scraped_at": "2025-07-17T19:33:50.800042",
    "name": "Reseller | VIP Membership",
    "prices": [
      7,
      1,
      7,
      1,
      119,
      16,
      0,
      3,
      12,
      5,
      4,
      7,
      7,
      119,
      0,
      12,
      5,
      0,
      0,
      5,
      4,
      8,
      52,
      7,
      1,
      7,
      1,
      119,
      16,
      0,
      3,
      12,
      5,
      4
    ],
    "original_price": 119,
    "discounted_price": 0,
    "description": "Reseller MembershipThanks for being our Premium Member of theAllPremiumShopFamily.What benefits will you receive?Direct Support from Admin.28 Days Membership.Discount on All Products. (Upto 10%)Live Chat SupportFREE Giveaway.FREE Lucky Buy x1Why AllPremiumShop?You will get more than 80+ OTT Platforms Subscription at affordable rates.We have completed more than 2000+ Orders, and More than 500+ Customers Reviewed and rated 5+.Our journey began in 2017We have started our journey in 2017, and we still love to provide you with our serviceOur customer support is second to none – users rave about how we don’t rest until every issue is solved to their satisfaction.Wide Range of OTT SubscriptionReseller | VIP MembershipOver–the–top media services (OTT) platforms have become quite popular in India in the last few years. An over-the-top (OTT) media service is a streaming media service offered directly to viewers via the internet. OTT bypasses cable, broadcast, and satellite television platforms, the companies that traditionally act as a controller or distributor of such content. Due to the COVID-19 outbreak in the country, many filmmakers are now releasing their movies on major OTT platforms, instead of waiting for the theatres to re-open",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "28 Days",
      "Premium",
      "Family",
      "Pro",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "Plan Includes28 Days Membership.Discount on All Products.(Upto 10%)Live Chat SupportFREE Giveaway.FREELucky Buy x1Warranty:28 Days"
  },
  {
    "url": "https://shopallpremium.com/product/digital-playground-premium/",
    "scraped_at": "2025-07-17T19:33:53.623709",
    "name": "Digital Playground Premium",
    "prices": [
      149,
      8,
      149,
      8,
      374,
      79,
      5,
      19,
      4,
      0,
      11,
      149,
      149,
      374,
      5,
      4,
      0,
      0,
      0,
      104,
      29,
      149,
      35,
      149,
      8,
      149,
      8,
      374,
      79,
      5,
      19,
      4,
      0,
      11
    ],
    "original_price": 374,
    "discounted_price": 0,
    "description": "# Digital Playground Premium",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinPORNFeaturesDigital Playground Premium MembershipTo be used on a single smartphone onlyUSA IP {VPN} Should be Connected.Personal Account*Important Terms*TYPE:Our Email PasswordVALIDITY:1 MonthPersonal AccountPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/bangbros-premium/",
    "scraped_at": "2025-07-17T19:33:56.494438",
    "name": "BangBros Premium – 1 Year",
    "prices": [
      149,
      35,
      149,
      35,
      4,
      1,
      8,
      119,
      16,
      0,
      11,
      149,
      8,
      149,
      149,
      4,
      1,
      119,
      0,
      149,
      0,
      0,
      149,
      8,
      7,
      20,
      149,
      35,
      149,
      35,
      4,
      1,
      8,
      119,
      16,
      0,
      11,
      149,
      8
    ],
    "original_price": 149,
    "discounted_price": 0,
    "description": "#BangBros Premium",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinPORNFeaturesBangBros PremiumWorks On All DevicesUSA IP {VPN} Should be Connected.Personal AccountStreaming + Downloads Available*Important Terms*TYPE:Our Email PasswordVALIDITY:1 YearPersonal AccountPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/reality-kings/",
    "scraped_at": "2025-07-17T19:33:58.921455",
    "name": "Reality Kings",
    "prices": [
      22,
      8,
      22,
      8,
      14,
      7,
      134,
      29,
      8,
      19,
      22,
      22,
      14,
      134,
      8,
      19,
      0,
      0,
      8,
      3,
      30,
      22,
      8,
      22,
      8,
      14,
      7,
      134,
      29,
      8,
      19
    ],
    "original_price": 134,
    "discounted_price": 0,
    "description": "# RealityKings PremiumNothing More to Explain",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinPORNFeaturesReality Kings PremiumWorks on All DevicesUSA IP {VPN} Should be Connected.Personal Account*Important Terms*TYPE:Email:PasswordVALIDITY:1 MonthPersonal AccountPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/random-validity-subscriptions/",
    "scraped_at": "2025-07-17T19:34:01.326231",
    "name": "Random Validity Subscriptions",
    "prices": [
      1,
      0,
      99,
      20,
      1,
      0,
      119,
      16,
      8,
      16,
      22,
      8,
      11,
      8,
      1,
      99,
      1,
      119,
      8,
      22,
      11,
      0,
      0,
      3,
      0,
      5,
      4,
      1,
      0,
      99,
      20,
      1,
      0,
      119,
      16,
      8,
      16,
      22,
      8,
      11,
      8
    ],
    "original_price": 119,
    "discounted_price": 0,
    "description": "Random Validity Premium Subscription Accounts Comes with Random Expiry (1-365 Days).Comes With 1 Time Login WarrantyDon’t Waste Money, if you want to watch a single web series/serials.Get a Random Validity Account.KARENJIT KAUR-THE UNTOLD STORY OF SUNNY LEONETHE FINAL CALLRANGBAAZ,Fourplay (IMDb Rating 6.5)Dev DD(IMDb Rating 6.5)It’s not that simple.Many MoreTop Best Indian Hindi Web SeriesThe Family Man (2019– )A working man from the National Investigation Agency tries to protect the nation from terrorism, but he also needs to keep his family safe from his secret job.Mirzapur (2018– )A shocking incident at a wedding procession ignites a series of events entangling the lives of two families in the lawless city of Mirzapur.Asur: Welcome to Your Dark Side (2020– )A unique crime thriller that pits two opposing worlds against each other. The less explored, intricate world of forensic science and the deep mysticism of ancient Indian Mythology.Palatal Lok (2020– )A down and out cop lands the case of a lifetime when four suspects are nabbed in the assassination attempt of a journalist. The pursuit of it leads him to ‘Paatal Lok’, and to shocking discoveries in the past of the four suspects.Undekhi (2020– )Set in West Bengal, the teaser begins with a couple of police officers investigating a murder in the jungle of Sunderbans. They visit along with locals to find a mutilated dead body.Special OPS (2020– )The story through the eyes of Himmat Singh is based on the inspiration was taken from Nineteen Years of nationally significant events, India undertook several espionage missions in the last two decades.Panchayat (2020– )",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "Premium Subscription Accounts Comes with Random Expiry (1-365 Days).Comes With 1 Time Login WarrantyDon’t Waste Money",
      "Account.KARENJIT KAUR-THE UNTOLD STORY OF SUNNY LEONETHE FINAL CALLRANGBAAZ",
      "365 Days",
      "Premium",
      "Family",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "Random Validity Subscriptions#3 Best Sellerin Combo Offers-80%₹99.00₹20.00Read Terms & ConditionsRandom Expiry (1-365 Days).*Important Terms*Do Not try to change the Email  & Password.CLEAR DATA OF APP BEFORE LOGINTYPE: Account (EMAIL & Password)VALIDITY: Random ValidityWarranty:NoneComes With 1 Time Login Warranty.No Replacement | Refund Policy."
  },
  {
    "url": "https://shopallpremium.com/product/youtube-premium/",
    "scraped_at": "2025-07-17T19:34:04.246220",
    "name": "YouTube Premium (India)",
    "prices": [
      8,
      16,
      8,
      16,
      119,
      16,
      8,
      3,
      30,
      8,
      52,
      8,
      8,
      119,
      8,
      3,
      8,
      0,
      0,
      0,
      11,
      0,
      7,
      8,
      16,
      8,
      16,
      119,
      16,
      8,
      3,
      30,
      8,
      52
    ],
    "original_price": 119,
    "discounted_price": 0,
    "description": "YouTube – PremiumYouTube – PREMIUM -No AdsGet the official YouTube app for Android phones and tablets. See what the world is watching — from the hottest music videos to what’s trending in gaming, entertainment, news, and more. Subscribe to channels you love, share with friends, and watch on any device.With a new design, you can have fun exploring videos you love more easily and quickly than before. Just tap an icon or swipe to switch between recommended videos, your subscriptions, or your account. You can also subscribe to your favorite channels, create playlists, edit and upload videos, express yourself with comments or shares, cast a video to your TV, and more – all from inside the app.Ad-free & background playEnjoy watching YouTube uninterrupted by ads whenever you sign in – on your mobile device, desktop or enabled TV. Watch videos uninterrupted by ads, while using other apps or when the screen is locked. Background playWith YouTube Premium, your video plays uninterrupted in the background, even when you open another app.DownloadsSave videos for when you really need them – like when you’re on a plane or commuting. Now, choose from more of your favourite videos to download and watch offline.YouTube Music PremiumYouTube Music PremiumDownload our new music app and listen without interruptions.FAQsWhat is included with YouTube Premium?YouTube• Ad-free videos: Watch millions of videos uninterrupted by ads.• Download videos to watch offline: Save videos and playlists on mobile devices and play them offline• Play in the background: Keep videos playing when using other apps or when your screen is off• Easily explore the world of music with the new and improved YouTube Music app• Ad-free music: Listen to millions of songs uninterrupted by ads• Download music to listen offline: Save music and playlists in the YouTube Music app and listen offline• Play in the background: Keep music playing when using other apps or when your screen is off • Ad-free and offline play in the YouTube Kids app • Included at no additional cost for selected countries.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "6 Months",
      "1 Year",
      "e or commuting. Now",
      "Premium",
      "PREMIUM",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "#1 Best SellerinSTREAMINGWith YouTube Premium, you can watch millions of videos without interruptions by ads before and during a video, including video overlay ads. You will also not see third-party banner ads and search ads.Works in INDIA ONLYLooking For Youtube Premium Works Worldwide?:Click HereFeaturesYouTube PremiumWatch videos without adsDownload videos to watch offlinePersonal AccountBackground play and Picture-in-pictureAccess to YouTube Music PremiumYouTube OriginalsAll Device Supported[Smart Phone, Tablet iOS, Mac, Windows, TV, PlayStation, FireStick, etc.]*Important Terms*TYPE:On Your Existing Gmail | Our Email PasswordVALIDITY:1 Year | 6 MonthsPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/leetcode-premium/",
    "scraped_at": "2025-07-17T19:34:07.118141",
    "name": "LeetCode Premium",
    "prices": [
      12,
      107,
      12,
      107,
      4,
      0,
      7,
      14,
      7,
      11,
      8,
      12,
      12,
      4,
      0,
      14,
      11,
      0,
      0,
      37,
      8,
      0,
      3,
      12,
      107,
      12,
      107,
      4,
      0,
      7,
      14,
      7,
      11,
      8
    ],
    "original_price": 107,
    "discounted_price": 0,
    "description": "LeetCode Premium | Video SolutionsNEWUnlock elaborate premium video solutions likethis. Each video includes a detailed conceptual overview and code walkthrough that will efficiently guide you through the problem.Access to Premium ContentGain exclusive access to our latest and ever-growing collection of premium content, such as questions, Explore cards, and premium solutions, where detailed explanations are written by our team of algorithm and data structure experts.Select Questions by CompanyTarget your studying more accurately towards your dream job. Find out which companies asked which questions, we have nearly 200 questions from Google alone.AutocompleteNot interested in memorization? With premium access, you receive intelligent code completion inside the LeetCode code editor based on language and an analysis of your source code.DebuggerTired ofSystem.out.println(val)? Set breakpoints and debug your code interactively line by line right inside our code editor.Lightning JudgeTired of waiting? Premium users get priority judging using an exclusive queue, resulting in a 3X shorter wait time, up to 10X during peak hours.Sort Questions by PrevalenceFind out which questions turn up most frequently in interviews so that you know where to focus your personal studying. Invaluable data collected from thousands of samples.Interview SimulationsMock assessments provide you with a way to test your abilities in a timed setting, just like a coding challenge or on-site interview. You choose the company and we will select an appropriate question from our constantly growing database.∞  Unlimited PlaygroundsPremium users can create an unlimited number of Playgrounds, up from 10! You also get the ability to organize your Playgrounds in folders.~ FAQ ~What will I get with a premium subscription?In addition to free questions / articles, you will have access to exclusive premium questions / articles as well. You will also be able to group questions by company, and practice mock assessments targeting a specific company.What are the premium articles? Is there a sample I can look at?Some of the articles are reserved for premium subscribers only. You can take a look at thisfree sample article here. Please note that we are adding more articles so please check back frequently.How does grouping questions by company work?We compile the list of questions asked by specific companies based on data from user surveys: “Have you met this question in a real interview?“. These lists will be kept up to date frequently with the ever growing survey data. You can find the list of companies in theproblem list page, just below the  Tag lists.What about all the existing questions?You will continue to have access to it all, it isn’t going anywhere.I clicked the subscribe button, fill in the credit card information and clicked “Add Payment Method”. I still can’t access the exclusive problems.You may accessMy Subscriptionpage to confirm your subscription. Please check yourbilling historyto make sure the transaction went through. If it shows no new transaction, it means your card was probably declined. Please try subscribe again using another debit/credit card or contact your bank to inquire for more information. If you still encounter problems,contact us.What if I sign up and want to cancel?You can cancel your subscription at any timehere. After cancellation your subscription will remain active until the current time period is finished.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "1 Month",
      "1 Year",
      "ations are written by our team of algorithm and data structure experts.Select Questions by CompanyTarget your studying more accurately towards your dream job. Find out which companies asked which questions",
      "Premium",
      "premium",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "LeetCode is a popular online platform for coding practice, technical interview preparation, and skill development for software developers. It provides a wide range of coding problems and tools to help users enhance their programming and problem-solving skills.Plan:PremiumbenefitsAccess to Premium ContentVideo SolutionsInterview Preparation ToolsInsights and AnalyticsEnhanced Contest FeaturesPriority SupportLearning and Practice ResourcesWorks on every platform[Smart Phone, Tablet iOS, Mac, Windows, TV, etc.]*Important Terms*It will be Activated on Your EmailTYPE:Account (Email & Password)VALIDITY:1 Month | 1 YearPersonal AccountPlease Read the Above Details Before Purchase."
  },
  {
    "url": "https://shopallpremium.com/product/magzter-gold-digital-magazines-newspapers/",
    "scraped_at": "2025-07-17T19:34:09.477024",
    "name": "Magzter GOLD: Digital Magazines & Newspapers",
    "prices": [
      1399,
      1399,
      45,
      739,
      45,
      239,
      7999,
      1099,
      99,
      20,
      1399,
      1399,
      45,
      45,
      7999,
      99,
      0,
      0,
      599,
      239,
      219,
      35,
      1399,
      1399,
      45,
      739,
      45,
      239,
      7999,
      1099,
      99,
      20
    ],
    "original_price": 7999,
    "discounted_price": 0,
    "description": "Magzter: Digital Magazines & NewspapersWorld’s largest digital reading destination with thousands of magazines and newspapersVoted the #1 digital reading destination by readers and top publishers from all over the worldMagzter, the world’s largest digital newsstand with thousands of magazines and newspapers in its catalogue, will change the way you read. From automotive, business, cooking, entertainment and fashion to lifestyle, news, sports, technology and travel, Magzter has magazines and newspapers across 40+ exciting categories to cater to your varied interests.Why you’ll love Magzter?1. Enjoy reading your favorite magazines and newspapers anytime and anywhere on the go.2. Magzter’s ezRead feature 2.0 revolutionizes the digital reading experience by presenting magazine and newspaper pages in responsive layouts that are automatically optimized for any size screen – smartphones as well as tablets. No longer is awkward panning and zooming required to read a digital magazine/newspaper article on a small screen!3. Access premium stories across exciting topics, curated from the best-selling magazines and newspapers.4. Download your favorite titles and read them later even when you’re offline.5. Bookmark your favorite pages to quickly access them later.6. Build your own follower base and share what you like from Magzter on Magzter Connect, an exciting social community within the app.7. Enjoy unlimited reading access at Smart Reading Zones.Top titles on MagzterAutomotive – Autocar, Car and Driver, Hot Rod, Road & Track, Top GearBusiness – Bloomberg Businessweek, Entrepreneur, Fast Company, Forbes, Fortune, Inc.Cooking – BBC Good Food UK, Bon Appétit, Food & Wine, Taste of HomeEntertainment – Entertainment Weekly, OK!, People, Us Weekly, TV Guide, Vanity FairFashion – Cosmopolitan, ELLE, Harper’s Bazaar, InStyle, Marie Claire, VogueFitness – Health, Men’s Health, Oxygen, Yoga JournalLifestyle – Esquire, GQ, Maxim, The Oprah MagazineNews – Mother Jones, Newsweek, New York, Reader’s Digest, The Atlantic, Time, India TodayNewspapers – Business Standard, Daily Mirror, Daily Star, Hindustan Times, The Guardian, The New PaperScience & Technology – Macworld, PC Magazine, PCWorld, Popular Mechanics, Popular Science, WiredSports – Golf, Sports Illustrated, Surfer, TennisTravel – Backpacker, Country, Condé Nast Traveler, Lonely Planet, National Geographic Traveller (UK), Travel+LeisureMagzter’s “All-You-Can-Read” subscription model, Magzter GOLD, gives users unlimited access to 5,000+ best-selling magazines (including their back issues), newspapers and premium stories for one low monthly price.",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "₹0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "et",
      "premium",
      "Standard"
    ],
    "category": "shopallpremium.com",
    "short_description": "*Important Terms*Do Not try to change the E-Mail or PasswordPLAN: GOLDPlunge into the world of Unlimited Reading right awayRead 5,000+ best-selling magazinesAccess premium stories and newspapersDownload to read offlineDigital OnlyTYPE:Account ( Email & Password)VALIDITY:1 Year | 3  YearsPersonal Account"
  },
  {
    "url": "https://shopallpremium.com/product/gta-v-premium-online-edition-pc/",
    "scraped_at": "2025-07-17T19:34:12.263942",
    "name": "GTA V : Premium Online Edition (PC)",
    "prices": [
      37,
      13,
      37,
      13,
      7,
      1,
      3,
      0,
      134,
      29,
      22,
      8,
      37,
      37,
      7,
      3,
      134,
      22,
      0,
      0,
      3,
      0,
      7,
      1,
      37,
      13,
      37,
      13,
      7,
      1,
      3,
      0,
      134,
      29,
      22,
      8
    ],
    "original_price": 134,
    "discounted_price": 0,
    "description": "GTA V : Premium Online Edition (PC)",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "Premium"
    ],
    "category": "shopallpremium.com",
    "short_description": "ORIGINAL KEYPlan  :GTA V : Online PREMIUM EDITION (PC)Official Link:: Click HereSystem Requirements and FAQ Check on Official SiteIt will be activated in your RockStar AccountTYPE:ORIGINAL KEYREFUND:No Refunds"
  },
  {
    "url": "https://shopallpremium.com/product/kooku/",
    "scraped_at": "2025-07-17T19:34:15.116648",
    "name": "KooKu",
    "prices": [
      0,
      2,
      8,
      52,
      0,
      3,
      12,
      107,
      22,
      10,
      0,
      8,
      0,
      12,
      22,
      0,
      0,
      0,
      7,
      22,
      10,
      0,
      2,
      8,
      52,
      0,
      3,
      12,
      107,
      22,
      10
    ],
    "original_price": 107,
    "discounted_price": 0,
    "description": "KookuKOOKU – Web Series, Short FilmsWeekend binges just got better! KOOKU is the latest entertainment hub, built to get your heart racing. Watch the best of drama, comedy, romance and much more on the KOOKU App.We are certain you will love our original programming of Short Films and Web Series. The best part is – you can Try before you buy!Original ContentUnlimited and Uninterrupted Video StreamingHD Quality contentWatch from anywhere in the world on your Mobile, Tablet or LaptopEasy & Flexible pricing",
    "features": [
      "My account",
      "Wishlist",
      "Checkout",
      "$0.000",
      "All Premium Shop",
      "Shop all",
      "CategoryWhat’s NewTrendingStreamingIndianInternationalResellerEducationalMUSICInternationalIndianMemberShipCombo OffersVPNsExtraHealth & FitnessDesignCloudPorn",
      "What’s New",
      "Trending",
      "StreamingIndianInternational"
    ],
    "duration_options": [
      "1 Month",
      "3 Months",
      "6 Months",
      "1 Year",
      "pro"
    ],
    "category": "shopallpremium.com",
    "short_description": "Comes with WarrantyComes with 1Yr | 6M | 3M | 1M Subscription Plan★ Shared Account*Important Terms*Do Not try to change the E-Mail or Password"
  }
]